fluidSolidInteraction/HronTurekFsi3/base/system/fluid/blockMeshDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
   (0 0 0)             //0
   (120 0 0)       //1
   (280 0 0)      //2
   (600 0 0)           //3
   (2500 0 0)          //4
   (0 120 0)       //5
   (120 120 0) //6
   (280 120 0)//7
   (600 120 0)     //8
   (2500 120 0)    //9
   (164.6447 164.6447 0)//10
   (235.3553 164.6447 0)//11
   (248.9898 190 0)     //12
   (299.5733 190 0)      //13
   (600 190 0)          //14
   (2500 190 0)         //15
   (164.6447 235.355 0) //16
   (235.3553 235.355 0) //17
   (248.9898 210 0)     //18
   (299.5733 210 0)      //19
   (600 210 0)          //20
   (2500 210 0)         //21
   (0 280 0)       //22
   (120 280 0) //23
   (280 280 0)//24
   (600 280 0)     //25
   (2500 280 0)    //26
   (0 410 0)            //27
   (120 410 0)      //28
   (280 410 0)     //29
   (600 410 0)          //30
   (2500 410 0)         //31

   (0 0 15)             //32
   (120 0 15)       //33
   (280 0 15)      //34
   (600 0 15)           //35
   (2500 0 15)          //36
   (0 120 15)       //37
   (120 120 15) //38
   (280 120 15)//39
   (600 120 15)     //40
   (2500 120 15)    //41
   (164.6447 164.6447 15)//42
   (235.3553 164.6447 15)//43
   (248.9898 190 15)     //44
   (299.5733 190 15)      //45
   (600 190 15)          //46
   (2500 190 15)         //47
   (164.6447 235.355 15) //48
   (235.3553 235.355 15) //49
   (248.9898 210 15)     //50
   (299.5733 210 15)      //51
   (600 210 15)          //52
   (2500 210 15)         //53
   (0 280 15)       //54
   (120 280 15) //55
   (280 280 15)//56
   (600 280 15)     //57
   (2500 280 15)    //58
   (0 410 15)            //59
   (120 410 15)      //60
   (280 410 15)     //61
   (600 410 15)          //62
   (2500 410 15)         //63

   (1000 0 0)                 //64
   (1000 120 0)           //65
   (1000 190 0)               //66
   (1000 210 0)               //67
   (1000 280 0)            //68
   (1000 410 0)               //69

   (1000 0 15)                 //70
   (1000 120 15)           //71
   (1000 190 15)               //72
   (1000 210 15)               //73
   (1000 280 15)          //74
   (1000 410 15)               //75

);

blocks
(
    hex (0 1 6 5 32 33 38 37) (6 6 1) simpleGrading (1 1 1)
    hex (1 2 7 6 33 34 39 38) (7 6 1) simpleGrading (1 1 1)
    hex (2 3 8 7 34 35 40 39) (15 6 1) simpleGrading (1 1 1)
    hex (3 64 65 8 35 70 71 40) (17 6 1) simpleGrading (1 1 1)
    hex (64 4 9 65 70 36 41 71) (12 6 1) simpleGrading (10 1 1)
    hex (5 6 23 22 37 38 55 54) (6 7 1) simpleGrading (1 1 1)
    hex (6 10 16 23 38 42 48 55) (5 7 1) simpleGrading (0.25 1 1)
    hex (6 7 11 10 38 39 43 42) (7 5 1) simpleGrading (1 0.25 1)
    hex (7 13 12 11 39 45 44 43) (4 5 1) simpleGrading (1 0.25 1)
    hex (7 8 14 13 39 40 46 45) (15 4 1) simpleGrading (1 1 1)
    hex (8 65 66 14 40 71 72 46) (17 4 1) simpleGrading (1 1 1)
    hex (65 9 15 66 71 41 47 72) (12 4 1) simpleGrading (10 1 1)
    hex (16 17 24 23 48 49 56 55) (7 5 1) simpleGrading (1 4 1)
    hex (17 18 19 24 49 50 51 56) (4 5 1) simpleGrading (1 4 1)
    hex (19 20 25 24 51 52 57 56) (15 4 1) simpleGrading (1 1 1)
    hex (20 67 68 25 52 73 74 57) (17 4 1) simpleGrading (1 1 1)
    hex (67 21 26 68 73 53 58 74) (12 4 1) simpleGrading (10 1 1)
    hex (22 23 28 27 54 55 60 59) (6 6 1) simpleGrading (1 1 1)
    hex (23 24 29 28 55 56 61 60) (7 6 1) simpleGrading (1 1 1)
    hex (24 25 30 29 56 57 62 61) (15 6 1) simpleGrading (1 1 1)
    hex (25 68 69 30 57 74 75 62) (17 6 1) simpleGrading (1 1 1)
    hex (68 26 31 69 74 58 63 75) (12 6 1) simpleGrading (10 1 1)
    hex (14 66 67 20 46 72 73 52) (17 1 1) simpleGrading (1 1 1)
    hex (66 15 21 67 72 47 53 73) (12 1 1) simpleGrading (10 1 1)
);

edges
(
    arc 23 24 (200 300 0)
    arc 55 56 (200 300 15)

    arc 16 17 (200 250 0)
    arc 48 49 (200 250 15)

    arc 6 7 (200 100 0)
    arc 38 39 (200 100 15)

    arc 10 11 (200 150 0)
    arc 42 43 (200 150 15)

    arc 6 23 (100 200 0)
    arc 38 55 (100 200 15)

    arc 10 16 (150 200 0)
    arc 42 48 (150 200 15)

    arc 17 18 (243.301 225 0)
    arc 49 50 (243.301 225 15)

    arc 24 19 (288.2725 258.6957 0)
    arc 56 51 (288.2725 258.6957 15)

    arc 11 12 (243.301 175 0)
    arc 43 44 (243.301 175 15)

    arc 13 7  (288.2725 141.3043 0)
    arc 45 39 (288.2725 141.3043 15)

);

patches
(
     patch plate
     (
         (19 18 50 51)
         (20 19 51 52)
         (20 52 46 14)
         (13 14 46 45)
         (12 13 45 44)
     )

     patch outlet
     (
         (63 31 26 58)
	 (58 26 21 53)
	 (53 21 15 47)
	 (47 15 9 41)
	 (41 9 4 36)
     )

     patch inlet
     (
         (27 59 54 22)
	 (22 54 37 5)
	 (5 37 32 0)
     )

     patch cylinder
     (
         (16 48 49 17)
	 (17 49 50 18)
	 (10 42 48 16)
	 (11 43 42 10)
	 (12 44 43 11)
     )

     patch bottom
     (
         (1 0 32 33)
         (2 1 33 34)
         (3 2 34 35)
         (64 3 35 70)
         (4 64 70 36)
     )

     patch top
     (
         (27 28 60 59)
	 (28 29 61 60)
	 (29 30 62 61)
	 (30 69 75 62)
	 (69 31 63 75)
     )

     empty frontAndBackPlanes
     (
         (22 23 28 27)
	 (23 24 29 28)
	 (24 25 30 29)
	 (25 68 69 30)
	 (68 26 31 69)
	 (5 6 23 22)
	 (6 10 16 23)
	 (16 17 24 23)
	 (18 19 24 17)
	 (19 20 25 24)
	 (20 67 68 25)
	 (67 21 26 68)
	 (6 7 11 10)
	 (7 13 12 11)
	 (7 8 14 13)
	 (8 65 66 14)
	 (65 9 15 66)
	 (0 1 6 5)
	 (1 2 7 6)
	 (2 3 8 7)
	 (3 64 65 8)
	 (64 4 9 65)
	 (14 66 67 20)
	 (66 15 21 67)

	 (33 32 37 38)
	 (34 33 38 39)
	 (35 34 39 40)
	 (70 35 40 71)
	 (36 70 71 41)
	 (38 37 54 55)
	 (42 38 55 48)
	 (39 38 42 43)
	 (45 39 43 44)
	 (40 39 45 46)
	 (71 40 46 72)
	 (41 71 72 47)
	 (49 48 55 56)
	 (51 50 49 56)
	 (52 51 56 57)
	 (73 52 57 74)
	 (53 73 74 58)
	 (55 54 59 60)
	 (56 55 60 61)
	 (57 56 61 62)
	 (74 57 62 75)
	 (58 74 75 63)
	 (72 46 52 73)
	 (47 72 73 53)
     )

);

mergePatchPairs
(
);

// ************************************************************************* //
