fluidSolidInteraction/HronTurekFsi3/base/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel     nonLinearGeometryTotalLagrangianTotalDisplacement;

nonLinearGeometryTotalLagrangianTotalDisplacementCoeffs
{
    // Solution algorithm
    //solutionAlgorithm implicitSegregated;
    solutionAlgorithm PETScSNES;
    //solutionAlgorithm explicit;

    // PETSc options file used by PETScSNES
    optionsFile petscOptions.lu;
    //optionsFile petscOptions.hypre;
    //optionsFile petscOptions.ilu;

    // Predict displacement at the start of a time-step
    predictor yes;
}

// ************************************************************************* //
