fluidSolidInteraction/HronTurekFsi3/base/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // Coupled solver
    "blockDD|blockD"
    {
        // Direct solver
        solver              EigenSparseLU;

        // Iterative solver
        //solver            BiCGStab;
        //preconditioner    myCholesky;
        //tolerance         1e-10;
        //relTol            0;
        //minIter           0;
        //maxIter           3000;
    }

    // Segregated solver
    "D|DD"
    {
        tolerance       1e-8;
        relTol          0.1;
        maxIter         50;

        solver          PCG;
        preconditioner  FDIC;
    }
}

relaxationFactors
{
    equations
    {
        //D           0.9999;
    }

    fields
    {
        //D              0.9;
    }
}

// ************************************************************************* //
